export const data = [
    {
        type: 'ei',
        q: '밤하늘의 수많은 별들중 당신은 어떤 별인가요?',
        a: ['가장 밝게 빛나는 별', '밝진 않지만 늘 제자리에 있는 별'],
    },
    {
        type: 'ft',
        q: '어떤 에너지가 당신을 움직이게 하나요?',
        a: ['주변 사람들의 따뜻한 관심과 유대감', '스스로 정한 논리적이고 명확한 목표'],
    },
    {
        type: 'ei',
        q: '당신의 별이 처음 발견되었어요.',
        a: ['많은 사람들이 주목하고 활발히 연구되길 원해요.', '주목 받진 않아도 꾸준히 연구되길 원해요.'],
    },
    {
        type: 'ft',
        q: '외계로 메시지를 보낼 수 있다면, 어떤 메세지를 보낼 건가요?',
        a: ['저 여기 있어요!', '...'],
    },
    {
        type: 'ei',
        q: '당신의 별 주위는 어떤가요?',
        a: ['많은 위성과 형제 행성들과 함께 존재해요.', '스스로 고요히 존재하고 있어요.'],
    },
    {
        type: 'ft',
        q: '당신은 어떤 방식으로 다른 사람들의 고민을 들어주나요?',
        a: ['공감해주고 응원해줘요.', '실질적인 해결방안을 제시해요.'],
    },
];

export const resultData = {
    ef: {
        name: '행성 EF',
        desc: '당신의 별은 <strong>긍정적인 에너지</strong>로 주변을 환하게 밝힙니다.',
        list: ['밤하늘에서 가장 빛나는 별이에요.', '주변 사람들과 좋은 유대를 가져요.', '친화력이 좋아요.', '항상 밝고 웃음이 많아요.'],
    },
    et: {
        name: 'ET행성',
        desc: '',
        list: [],
    },
    if: {
        name: 'IF행성',
        desc: '',
        list: [],
    },
    it: {
        name: 'IT행성',
        desc: '',
        list: [],
    },
};
